/*   UI.h    */

/* ------------------------------定义防止递归包含 ----------------------------*/
#ifndef  __UI_H_
#define  __UI_H_
/* -------------------------------包含的头文件 -------------------------------*/
#include "sys.h"


/***********************************************************************/
//LCD显示屏UI接口
//作者：朱庆倩
/***********************************************************************/


void UI_Option(u8 **p, u16 num, int *selectedID);													     	//显示菜单
void UI_Operate(void);													     	//操作指南
void UI_Map(void);													     	//绘制地图
void UI_MapHelp(void);													     	//地图指南
void UI_AboutMACM(void);
void UI_Error(u8 *p);
u16  UI_WaitKey(u16 time);								     	       //等待按键








#endif /*  */




