/*   sensor.h    */

/* ------------------------------定义防止递归包含 ----------------------------*/
#ifndef  __SENSOR_H_
#define  __SENSOR_H_

/* -------------------------------包含的头文件 -------------------------------*/
#include "sys.h"


/***********************************************************************/
//空气传感器接口
//作者：杨赟@上海交通大学
/***********************************************************************/

void Sensor_PMInit(void);  //粉尘传感器初始化
void Sensor_PMValue(u16 PM2_5, u16 PM10, u16 PM1);  //返回粉尘值

void Sensor_CH2OInit(void);  //甲醛传感器初始化
void Sensor_CH2OValue(u16 ug_m3, u16 ppb);  //返回甲醛浓度

#endif /*  */
